![png](Data/books.png)

In [1]:
import pandas as pd
from sqlalchemy.engine import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
from sqlalchemy_utils import create_database, database_exists

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = "Encychlamydia1" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
connection = f"mysql+pymysql://{username}:{password}@localhost/books"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [4]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [5]:
q = '''SELECT * FROM authors;'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [id, author_name]
Index: []

In [6]:
q = '''SELECT * FROM books;'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [id, title, authors_id]
Index: []

In [7]:
q = '''SELECT * FROM favorites;'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [books_id, users_id]
Index: []

In [8]:
q = '''SELECT * FROM users;'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [id, first_name, last_name, email]
Index: []

In [9]:
authors = pd.read_csv('Data/authors - authors.csv')
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [10]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, engine)
describe

         Field         Type Null  Key Default Extra
0           id          int   NO  PRI    None
1  author_name  varchar(45)  YES         None

In [11]:
describe['Field'].values

array(['id', 'author_name'], dtype=object)

In [12]:
authors.columns

Index(['id', 'author_name'], dtype='object')

In [13]:
describe[['Field','Type']]

         Field         Type
0           id          int
1  author_name  varchar(45)

In [14]:
authors.dtypes

id              int64
author_name    object
dtype: object

In [15]:
books = pd.read_csv('Data/books - books.csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [16]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, engine)
describe

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1       title  varchar(45)  YES         None
2  authors_id          int   NO  MUL    None

In [17]:
describe['Field'].values

array(['id', 'title', 'authors_id'], dtype=object)

In [18]:
books.columns

Index(['id', 'title', 'author_id'], dtype='object')

In [19]:
rename_map = {"author_id":"authors_id"}
books = books.rename(rename_map, axis=1)
books.head(2)

   id        title  authors_id
0   1  The Shining           1
1   2           It           1

In [20]:
describe[['Field','Type']]

        Field         Type
0          id          int
1       title  varchar(45)
2  authors_id          int

In [21]:
books.dtypes

id             int64
title         object
authors_id     int64
dtype: object

In [22]:
favorites = pd.read_csv('Data/favorites - favorites.csv')
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [23]:
q = '''DESCRIBE favorites;'''
describe = pd.read_sql(q, engine)
describe

      Field Type Null  Key Default Extra
0  books_id  int   NO  PRI    None
1  users_id  int   NO  PRI    None

In [24]:
describe['Field'].values

array(['books_id', 'users_id'], dtype=object)

In [25]:
favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [26]:
rename_map = {"user_id":"users_id","book_id":"books_id"}
favorites = favorites.rename(rename_map, axis=1)
favorites.head(2)

   users_id  books_id
0         1         1
1         1         2

In [27]:
describe[['Field','Type']]

      Field Type
0  books_id  int
1  users_id  int

In [28]:
favorites.dtypes

users_id    int64
books_id    int64
dtype: object

In [29]:
users = pd.read_csv('Data/users  - users.csv')
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [30]:
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, engine)
describe

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [31]:
describe['Field'].values

array(['id', 'first_name', 'last_name', 'email'], dtype=object)

In [32]:
users.columns

Index(['id', 'first_name', 'last_name', 'email'], dtype='object')

In [33]:
describe[['Field','Type']]

        Field         Type
0          id          int
1  first_name  varchar(45)
2   last_name  varchar(45)
3       email  varchar(45)

In [34]:
users.dtypes

id             int64
first_name    object
last_name     object
email         object
dtype: object

In [35]:
authors.to_sql("authors", engine, index=False, if_exists='append')

5

In [36]:
q = '''SELECT * FROM authors;'''
pd.read_sql(q, engine)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [37]:
q = '''DESCRIBE authors;'''
pd.read_sql(q, engine)

         Field         Type Null  Key Default Extra
0           id          int   NO  PRI    None
1  author_name  varchar(45)  YES         None

In [38]:
books.to_sql("books", engine, index=False, if_exists='append')

6

In [39]:
q = '''SELECT * FROM books;'''
pd.read_sql(q, engine)

   id                 title  authors_id
0   1           The Shining           1
1   2                    It           1
2   3      The Great Gatsby           2
3   4  The Call of the Wild           3
4   5   Pride and Prejudice           4
5   6          Frankenstein           5

In [40]:
q = '''DESCRIBE books;'''
pd.read_sql(q, engine)

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1       title  varchar(45)  YES         None
2  authors_id          int   NO  MUL    None

In [41]:
users.to_sql("users", engine, index=False, if_exists='append')

3

In [42]:
q = '''SELECT * FROM users;'''
pd.read_sql(q, engine)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [43]:
q = '''DESCRIBE users;'''
pd.read_sql(q, engine)

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [44]:
favorites.to_sql("favorites", engine, index=False, if_exists='append')

7

In [45]:
q = '''SELECT * FROM favorites;'''
pd.read_sql(q, engine)

   books_id  users_id
0         1         1
1         2         1
2         3         1
3         4         2
4         5         2
5         5         3
6         6         3

In [46]:
q = '''DESCRIBE favorites;'''
pd.read_sql(q, engine)

      Field Type Null  Key Default Extra
0  books_id  int   NO  PRI    None
1  users_id  int   NO  PRI    None

In [47]:
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [48]:
q = '''SELECT books.title, favorites.users_id
FROM books
JOIN favorites ON books.id = favorites.books_id
WHERE favorites.users_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));'''
pd.read_sql(q, engine)

              title  users_id
0       The Shining         1
1                It         1
2  The Great Gatsby         1